In [1]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression
import seaborn as sns

In [2]:
#data
hiring_data={
    "experience": {
        0: np.nan,
        1: np.nan,
        2: "five",
        3: "two",
        4: "seven",
        5: "three",
        6: "ten",
        7: "eleven",
    },
    "test_score(out of 10)": {
        0: 8.0,
        1: 8.0,
        2: 6.0,
        3: 10.0,
        4: 9.0,
        5: 7.0,
        6: np.nan,
        7: 7.0,
    },
    "interview_score(out of 10)": {0: 9, 1: 6, 2: 7, 3: 10, 4: 6, 5: 10, 6: 7, 7: 8},
    "salary($)": {
        0: 50000,
        1: 45000,
        2: 60000,
        3: 65000,
        4: 70000,
        5: 62000,
        6: 72000,
        7: 80000,
    },
}

In [3]:
df=pd.DataFrame(hiring_data)

In [4]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [5]:
df.isnull().sum()

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [6]:
df['experience'].fillna('zero',inplace=True)

In [7]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [8]:
df['experience']=df['experience'].map({'zero':0,'five':5,'two':2,'seven':7,'three':3,'ten':10,'eleven':11})

In [9]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [10]:
df['test_score(out of 10)'].fillna(df['test_score(out of 10)'].mean(),inplace=True)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0               8.000000                           9      50000
1           0               8.000000                           6      45000
2           5               6.000000                           7      60000
3           2              10.000000                          10      65000
4           7               9.000000                           6      70000
5           3               7.000000                          10      62000
6          10               7.857143                           7      72000
7          11               7.000000                           8      80000

In [11]:
df['experience']=df['experience'].astype('category')

In [12]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0               8.000000                           9      50000
1          0               8.000000                           6      45000
2          5               6.000000                           7      60000
3          2              10.000000                          10      65000
4          7               9.000000                           6      70000
5          3               7.000000                          10      62000
6         10               7.857143                           7      72000
7         11               7.000000                           8      80000

In [13]:
df.info

<bound method DataFrame.info of   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0               8.000000                           9      50000
1          0               8.000000                           6      45000
2          5               6.000000                           7      60000
3          2              10.000000                          10      65000
4          7               9.000000                           6      70000
5          3               7.000000                          10      62000
6         10               7.857143                           7      72000
7         11               7.000000                           8      80000>

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   experience                  8 non-null      category
 1   test_score(out of 10)       8 non-null      float64
 2   interview_score(out of 10)  8 non-null      int64
 3   salary($)                   8 non-null      int64
dtypes: category(1), float64(1), int64(2)
memory usage: 620.0 bytes

In [15]:
df.columns

Index(['experience', 'test_score(out of 10)', 'interview_score(out of 10)',
       'salary($)'],
      dtype='object')

In [16]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0               8.000000                           9      50000
1          0               8.000000                           6      45000
2          5               6.000000                           7      60000
3          2              10.000000                          10      65000
4          7               9.000000                           6      70000
5          3               7.000000                          10      62000
6         10               7.857143                           7      72000
7         11               7.000000                           8      80000

In [17]:
X=df.drop(columns=['salary($)'])

In [18]:
y=df['salary($)']

In [19]:
lr=LinearRegression()
lr.fit(X,y)
y_pred=lr.predict(X)

In [21]:
salary_1=lr.predict([[2,9,6]])
salary_1

C:\Users\user\anaconda3\Lib\site-packages\sklearn\base.py:439: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([53290.89255945])

In [22]:
salary_2=lr.predict([[12,10,10]])
salary_2

C:\Users\user\anaconda3\Lib\site-packages\sklearn\base.py:439: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([92268.07227784])

In [23]:
score=lr.score(X,y)
score

0.9639958361860578